Feature: Добавяне на тема
  Scenario: Добавяне на тема
    Given Отваряне на екрана за добавяне на теми
    When Въвеждане на заглавие:"Рецепта"
    And Въвеждане на описание:"Продукти"
    And Натискане на бутона за добавяне
    Then Виждаме съобщение: "Успешна добавена тема!"

  Scenario: Добавяне на празна тема
    Given Отваряне на екрана за добавяне на теми
    When Натискане на бутона за добавяне
    Then Виждаме съобщение: "Моля въведете тема!"

  Scenario: Добавяне на тема без заглавие
    Given Отваряне на екрана за добавяне на теми
    When Въвеждане на описание:"Продукти"
    And Натискане на бутона за добавяне
    Then Виждаме съобщение: "Моля въведете заглавие!"

  Scenario: Добавяне на тема без описание
    Given Отваряне на екрана за добавяне на теми
    When Въвеждане на заглавие:"Рецепта"
    And Натискане на бутона за добавяне
    Then Виждаме съобщение: "Моля въведете описание!"



