Feature: Изтриване на коментар
  Scenario: Изтриване на коментар от потребител с админски права
    Given Отваряне на екрана с теми за коментиране
    And Избиране на определена тема за коментиране
    And Съществува поне 1 коментар
    And Потребителя е админ
    When Натискане на бутона за изтриване на коментар
    Then Виждаме съобщение: "Успешно изтрит коментар!"

  Scenario: Изтриване на коментар от потребител без админски права
    Given Отваряне на екрана с теми за коментиране
    And Избиране на определена тема за коментиране
    And Съществува поне 1 коментар
    And Потребителя не е админ
    When Натискане на бутона за изтриване на коментар
    Then Виждаме съобщение: "Само админ може да изтрие тема!"