Feature: Изтриване на тема
  Scenario: Изтриване на тема от потребител с админски права
    Given Отваряне на екрана с всички теми
    And Съществува поне 1 тема
    And Потребителя е админ
    When Избиране на определена тема
    And Бутона за изтриване се вижда
    And Натискане на бутона за изтриване
    Then Виждаме съобщение: "Успешна изтрита тема!"

  Scenario: Изтриване на тема от потребител
    Given Отваряне на екрана с всички теми
    And Съществува поне 1 тема
    And Потребителя не е админ
    When Избиране на определена тема
    Then Бутона за изтриване не се вижда

  Scenario: Изтриване на тема която не съществува
    Given Отваряне на екрана с всички теми
    And Съществува поне 1 тема
    And Потребителя е админ
    When Избиране на определена тема
    And Бутона за изтриване се вижда
    And Всички теми се изтриват
    And Натискане на бутона за изтриване
    Then Виждаме съобщение: "Темата не съществува!"

  Scenario: Изтриване на тема след премахване на админски права
    Given Отваряне на екрана с всички теми
    And Съществува поне 1 тема
    And Потребителя е админ
    When Избиране на определена тема
    And Бутона за изтриване се вижда
    And Потребителя вече не е админ
    And Натискане на бутона за изтриване
    Then Виждаме съобщение: "Само админ може да изтрие тема!"
